# Common tools for all machines

brew "xz"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "ghq"
brew "git"
brew "lazygit"
brew "mas"
brew "fnm"
brew "jq"
brew "pyenv"
brew "starship"
brew "uv"
brew "wireshark"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "claude"
cask "claude-code"
cask "font-blex-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "notion"
cask "raycast"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
