42crunch.vscode-openapi
aaron-bond.better-comments
alefragnani.project-manager
anthropic.claude-code
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
humao.rest-client
janisdd.vscode-edit-csv
johnpapa.vscode-peacock
leodevbro.blockman
lokalise.i18n-ally
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
mohammadbaqer.better-folding
mosapride.zenkaku
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
pkief.material-icon-theme
redhat.java
redhat.vscode-yaml
richie5um2.vscode-sort-json
ryanluker.vscode-coverage-gutters
ryu1kn.partial-diff
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
vue.volar
vunguyentuan.vscode-css-variables
yzhang.markdown-all-in-one
