0h7z.vscode-julia-format
aaron-bond.better-comments
andrepimenta.claude-code-chat
anseki.vscode-color
anthropic.claude-code
bierner.markdown-mermaid
biomejs.biome
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
clemenspeters.format-json
corschenzi.mermaid-graphical-editor
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
formulahendry.auto-rename-tag
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
gruntfuggly.todo-tree
hediet.vscode-drawio
ionutvmi.path-autocomplete
janisdd.vscode-edit-csv
julialang.language-julia
leodevbro.blockman
mangano-ito.git-branch-wise-session
mechatroner.rainbow-csv
meta.pyrefly
mikestead.dotenv
mohammadbaqer.better-folding
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vsliveshare.vsliveshare
njqdev.vscode-python-typehint
oderwat.indent-rainbow
pixl-garden.bongocat
pkief.material-icon-theme
qwtel.sqlite-viewer
redhat.vscode-yaml
ritwickdey.liveserver
ryanluker.vscode-coverage-gutters
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tomoki1207.pdf
usernamehw.errorlens
vitaliymaz.vscode-svg-previewer
vscodevim.vim
yzhang.markdown-all-in-one
zainchen.json
